In [285]:
import pandas as pd
import seaborn as sns

In [286]:
df = sns.load_dataset('titanic')

In [287]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [288]:
df_copy = df.copy()

## 기본 데이터 탐색
- 데이터 확인 (describe, head 등을 사용하여 데이터의 기본정보 확인)

In [289]:
print(df_copy.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

In [290]:
print(df_copy.describe())

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

## 각 열의 결측치 개수 확인, 적절한 방법으로 결측치 처리

In [291]:
df_copy['age'].isnull().sum()

np.int64(177)

In [292]:
cond = df_copy.isnull()['age']
df_copy.loc[cond]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [293]:
# 나이의 null값은 성별에 따라 평균 나이로 대체
# 여성의 평균 나이 구하기

female_data = df_copy[df_copy['sex'] == 'female']
female_age_mean = round(female_data['age'].mean(skipna=True))
# round = 반올림

female_age_mean

28

In [294]:
# fillna_female_mean = df_copy.loc[df_copy['sex'] == 'female', 'age'].fillna(female_age_mean) ---- fail
# 긴 한 줄 말고 끊어서 쓰기

In [295]:
df_copy.loc[df_copy['sex'] == 'female', 'age'] = \
df_copy.loc[df_copy['sex'] == 'female', 'age'].fillna(female_age_mean)

In [296]:
male_data = df_copy[df_copy['sex'] == 'male']
male_age_mean = round(male_data['age'].mean(skipna=True))

male_age_mean

31

In [297]:
df_copy.loc[df_copy['sex'] == 'male', 'age'] = \
df_copy.loc[df_copy['sex'] == 'male', 'age'].fillna(male_age_mean)

In [298]:
df_copy['age'].isnull().sum()

np.int64(0)

In [299]:
df_copy.drop(['deck'], axis=1, inplace=True)

In [300]:
df_copy.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [301]:
df_copy.dropna(inplace=True)

In [302]:
df_copy.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

## 데이터 전처리
- 불필요한 컬럼 제거
    - 예측 모델링에 필요하지 않은 sibsp, parch 컬럼을 삭제하세요.

In [303]:
df_copy.drop(['sibsp', 'parch'], axis=1, inplace=True)

In [304]:
df_copy.head(1)

,survived,pclass,sex,age,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,7.25,S,Third,man,True,Southampton,no,False

## 데이터 시각화 (Matplotlib 활용)
- 생존자 분포 시각화
Survived 컬럼을 기준으로 생존자와 사망자의 비율을 bar plot 또는 pie chart로 시각화하세요.

- 연령대별 생존율 분석
연령(age)을 특정 구간으로 나누고, 각 연령대별 생존율을 bar plot으로 나타내세요.

In [306]:
import matplotlib.pyplot as plt

In [ ]:
survived = df_copy['

']